
# DOTFILE TODO

# Taps
tap 'homebrew/cask'
tap 'homebrew/cask-eid'
tap 'homebrew/cask-fonts'
tap 'homebrew/cask-versions'
tap 'homebrew/bundle'

# Binaries
brew 'awscli'
brew 'bash' # Latest Bash version
brew 'bat' # "cat" on steroids
brew 'Caskroom/cask/rstudio'
brew 'coreutils' # Those that come with macOS are outdated
brew 'eslint'
brew 'git'
brew 'grep'
brew 'hub'
brew 'mackup'
brew 'mas' # Mac App Store manager
brew 'pkg-config' # https://github.com/driesvints/dotfiles/issues/20
brew 'telnet'
brew 'terminal-notifier'
brew 'thefuck'
brew 'tig'
brew 'trash'
brew 'tree'
brew 'tree' # List directories in a tree structure
brew 'visual-studio-code'
brew 'zlib' # Needed for Memcached

# Development

brew 'imagemagick'
brew 'lastpass-cli'
brew 'mysql'
brew 'nginx'
brew 'yarn'

# Apps
cask 'activitywatch'
cask 'alfred'
cask 'arq-cloud-backup'
cask 'atom'
cask 'discord'
cask 'docker-compose'
cask 'docker'
cask 'dozer'
cask 'firefox'
cask 'github'
cask 'google-backup-and-sync'
cask 'google-chrome'
cask 'gpg-suite'
cask 'insomnia'
cask 'iterm2'
cask 'nvm'
cask 'purevpn'
cask 'rescuetime'
cask 'signal'
cask 'slack'
cask 'sourcetree'
cask 'spotify'
cask 'the-unarchiver'
cask 'transmission'
cask 'transmit'
cask 'unnaturalscrollwheels' # https://github.com/ther0n/UnnaturalScrollWheels
cask 'virtualbox'
cask 'vlc'
cask 'zoomus'

# Quicklook
cask 'qlcolorcode'
cask 'qlmarkdown'
cask 'quicklook-json'
cask 'quicklook-csv'
cask 'qlstephen'

# Fonts
cask 'font-lato'
cask 'font-open-sans'
cask 'font-roboto'
cask 'font-roboto-condensed'
cask 'font-source-code-pro-for-powerline'
cask 'font-source-code-pro'
cask 'font-source-sans-pro'
cask 'font-source-serif-pro'

# Mac App Store
# TODO: check mac app store
# mas '', id: 

mas 'DaisyDisk', id: 411643860
mas 'ia Writer', id: 775737590
mas 'Giphy Capture', id: 668208984
mas 'Harvest', id: 506189836
mas 'LastPass', id: 926036361
mas 'Skitch', id: 425955336
# mas 'Giphy Capture', id: 668208984

# Disabled!

# brew tap 'jondot/tap'
# brew 'hygen'
# brew cask 'obs'

# brew 'httpie'
# brew 'stripe/stripe-cli/stripe'
# brew 'node' - moved to nvm

# cask 'aerial'
# cask 'screenflow' # maybe layer
# cask 'sip'
# cask 'skype'
# cask 'sublime-text'
# cask 'tableplus'
# cask 'virtualbox' # Might need to allow access in Security settings
# cask 'virtualbox-extension-pack'
# cask 'whatsapp'

# cask 'xquartz' # for R
# cask 'openmtp' # android file transfer https://github.com/ganeshrvel/openmtp
# cask install mactex-no-gui # latex is quite large
# cask 'dotnet-sdk-3.1.300' # uncomment the tap CHECKME: dotnet-sdk-<version>
    # tap 'isen-ng/dotnet-sdk-versions' # dotnet
# brew wp-cli
# brew mongodb-community@4.2# uncomment the tap # check current version
    # tap mongodb/brew
# brew ruby
# todo-txt

# ruby:
# 
#     brew 'rbenv' #ruby
#     brew 'ruby-build' #ruby
#     # TODO: where to put rbenv commands?
#     rbenv install 2.7.1
#     rbenv global 2.7.1
#     ruby -v
# 
#     To link Rubies to Homebrew's OpenSSL 1.1 (which is upgraded) add the following to your ~/.zshrc:
#         export RUBY_CONFIGURE_OPTS="--with-openssl-dir=$(brew --prefix openssl@1.1)"
