code --install-extension 4a1c0.voice-comments
code --install-extension aaron-bond.better-comments
code --install-extension aeschli.vscode-css-formatter
code --install-extension albymor.increment-selection
code --install-extension alefragnani.Bookmarks
code --install-extension alexkrechik.cucumberautocomplete
code --install-extension amiralizadeh9480.laravel-extra-intellisense
code --install-extension bajdzis.vscode-database
code --install-extension bejjang2.vue-jsdoc
code --install-extension Blodwynn.featurehighlight
code --install-extension bmewburn.vscode-intelephense-client
code --install-extension BorisA.calc
code --install-extension burkeholland.simple-react-snippets
code --install-extension christian-kohler.npm-intellisense
code --install-extension christian-kohler.path-intellisense
code --install-extension cjhowe7.laravel-blade
code --install-extension cmstead.jsrefactor
code --install-extension codingyu.laravel-goto-view
code --install-extension CoenraadS.bracket-pair-colorizer-2
code --install-extension dariofuzinato.vue-peek
code --install-extension darkriszty.markdown-table-prettify
code --install-extension DavidAnson.vscode-markdownlint
code --install-extension dbaeumer.vscode-eslint
code --install-extension dbankier.vscode-quick-select
code --install-extension deerawan.vscode-dash
code --install-extension eamodio.gitlens
code --install-extension EditorConfig.EditorConfig
code --install-extension eg2.vscode-npm-script
code --install-extension esbenp.prettier-vscode
code --install-extension everettjf.filter-line
code --install-extension fabiospampinato.vscode-diff
code --install-extension fabiospampinato.vscode-projects-plus
code --install-extension fabiospampinato.vscode-projects-plus-todo-plus
code --install-extension fabiospampinato.vscode-todo-plus
code --install-extension fcrespo82.markdown-table-formatter
code --install-extension felixfbecker.php-debug
code --install-extension firefox-devtools.vscode-firefox-debug
code --install-extension formulahendry.auto-rename-tag
code --install-extension ghmcadams.lintlens
code --install-extension gitduck.code-streaming
code --install-extension GitHub.vscode-pull-request-github
code --install-extension glen-84.sass-lint
code --install-extension gottfired.css2react
code --install-extension Gruntfuggly.todo-tree
code --install-extension gxiao.cookiecutter
code --install-extension hollowtree.vue-snippets
code --install-extension HookyQR.beautify
code --install-extension humy2833.ftp-simple
code --install-extension Ikuyadeu.r
code --install-extension janisdd.vscode-edit-csv
code --install-extension jcbuisson.vue
code --install-extension jdinhlife.gruvbox
code --install-extension jpoissonnier.vscode-styled-components
code --install-extension khaeransori.json2csv
code --install-extension kiteco.kite
code --install-extension Kurozero.vscode-commit-reminder
code --install-extension lindraupe.aw-watcher-vscode
code --install-extension mdickin.markdown-shortcuts
code --install-extension mdw.vscode-todo-plus-plus
code --install-extension mechatroner.rainbow-csv
code --install-extension mhutchie.git-graph
code --install-extension mikestead.dotenv
code --install-extension Mikhail-Arkhipov.r
code --install-extension mohsen1.prettify-json
code --install-extension ms-azuretools.vscode-docker
code --install-extension ms-mssql.mssql
code --install-extension ms-python.python
code --install-extension ms-vscode-remote.remote-containers
code --install-extension ms-vscode-remote.remote-ssh
code --install-extension ms-vscode-remote.remote-ssh-edit
code --install-extension ms-vscode-remote.remote-wsl
code --install-extension ms-vscode-remote.vscode-remote-extensionpack
code --install-extension ms-vscode.atom-keybindings
code --install-extension ms-vsliveshare.vsliveshare
code --install-extension ms-vsliveshare.vsliveshare-audio
code --install-extension msjsdiag.debugger-for-chrome
code --install-extension Mukundan.python-docs
code --install-extension naumovs.color-highlight
code --install-extension njLeonZhang.markdown-image-paste
code --install-extension njpwerner.autodocstring
code --install-extension nonoroazoro.syncing
code --install-extension octref.vetur
code --install-extension onecentlin.laravel-blade
code --install-extension onecentlin.laravel-extension-pack
code --install-extension onecentlin.laravel5-snippets
code --install-extension paulhoughton.vscode-jscpd
code --install-extension prashaantt.node-tdd
code --install-extension quicktype.quicktype
code --install-extension rafaelmaiolla.diff
code --install-extension raidou.calc
code --install-extension rbbit.typescript-hero
code --install-extension redhat.java
code --install-extension redhat.vscode-yaml
code --install-extension REditorSupport.r-lsp
code --install-extension remimarsal.prettier-now
code --install-extension RescueTime.rescuetime
code --install-extension richie5um2.vscode-sort-json
code --install-extension ryannaddy.laravel-artisan
code --install-extension ryu1kn.partial-diff
code --install-extension sandcastle.vscode-open
code --install-extension sdras.vue-vscode-snippets
code --install-extension Shan.code-settings-sync
code --install-extension shd101wyy.crossnote
code --install-extension shd101wyy.markdown-preview-enhanced
code --install-extension silvenon.mdx
code --install-extension softwaredotcom.music-time
code --install-extension softwaredotcom.swdc-vscode
code --install-extension spikespaz.vscode-smoothtype
code --install-extension stef-k.laravel-goto-controller
code --install-extension stevejpurves.cucumber
code --install-extension stevencl.addDocComments
code --install-extension stylelint.vscode-stylelint
code --install-extension syler.sass-indented
code --install-extension thomanq.math-snippets
code --install-extension TianyiShi.rmarkdown
code --install-extension tomoki1207.pdf
code --install-extension Tyriar.sort-lines
code --install-extension vincaslt.highlight-matching-tag
code --install-extension VisualStudioExptTeam.vscodeintellicode
code --install-extension vscjava.vscode-java-debug
code --install-extension vscjava.vscode-java-dependency
code --install-extension vscjava.vscode-java-pack
code --install-extension vscjava.vscode-java-test
code --install-extension vscjava.vscode-maven
code --install-extension vscoss.vscode-ansible
code --install-extension waderyan.gitblame
code --install-extension WakaTime.vscode-wakatime
code --install-extension wayou.vscode-todo-highlight
code --install-extension wix.vscode-import-cost
code --install-extension Wscats.eno
code --install-extension xabikos.JavaScriptSnippets
code --install-extension xabikos.ReactSnippets
code --install-extension xyc.vscode-mdx-preview
code --install-extension yzhang.markdown-all-in-one
code --install-extension ZainChen.json
code --install-extension Zignd.html-css-class-completion
